bench/out/v4-seatmap-on.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: bench/seatmap.js
        output: -

     scenarios: (100.00%) 1 scenario, 200 max VUs, 45s max duration (incl. graceful stop):
              * read: 200.00 iterations/s for 15s (maxVUs: 50-200, gracefulStop: 30s)


running (01.0s), 001/050 VUs, 192 complete and 0 interrupted iterations
read   [   6% ] 001/050 VUs  01.0s/15s  200.00 iters/s

running (02.0s), 001/050 VUs, 392 complete and 0 interrupted iterations
read   [  13% ] 001/050 VUs  02.0s/15s  200.00 iters/s

running (03.0s), 006/050 VUs, 587 complete and 0 interrupted iterations
read   [  20% ] 006/050 VUs  03.0s/15s  200.00 iters/s

running (04.0s), 001/050 VUs, 792 complete and 0 interrupted iterations
read   [  26% ] 001/050 VUs  04.0s/15s  200.00 iters/s

running (05.0s), 001/050 VUs, 992 complete and 0 interrupted iterations
read   [  33% ] 001/050 VUs  05.0s/15s  200.00 iters/s

running (06.0s), 001/050 VUs, 1192 complete and 0 interrupted iterations
read   [  40% ] 001/050 VUs  06.0s/15s  200.00 iters/s

running (07.0s), 002/050 VUs, 1391 complete and 0 interrupted iterations
read   [  46% ] 002/050 VUs  07.0s/15s  200.00 iters/s

running (08.0s), 001/050 VUs, 1592 complete and 0 interrupted iterations
read   [  53% ] 001/050 VUs  08.0s/15s  200.00 iters/s

running (09.0s), 001/050 VUs, 1792 complete and 0 interrupted iterations
read   [  60% ] 001/050 VUs  09.0s/15s  200.00 iters/s

running (10.0s), 001/050 VUs, 1992 complete and 0 interrupted iterations
read   [  66% ] 001/050 VUs  10.0s/15s  200.00 iters/s

running (11.0s), 001/050 VUs, 2192 complete and 0 interrupted iterations
read   [  73% ] 001/050 VUs  11.0s/15s  200.00 iters/s

running (12.0s), 001/050 VUs, 2392 complete and 0 interrupted iterations
read   [  80% ] 001/050 VUs  12.0s/15s  200.00 iters/s

running (13.0s), 004/050 VUs, 2589 complete and 0 interrupted iterations
read   [  86% ] 004/050 VUs  13.0s/15s  200.00 iters/s

running (14.0s), 001/050 VUs, 2792 complete and 0 interrupted iterations
read   [  93% ] 001/050 VUs  14.0s/15s  200.00 iters/s

running (15.0s), 001/050 VUs, 2992 complete and 0 interrupted iterations
read   [ 100% ] 001/050 VUs  15.0s/15s  200.00 iters/s


  █ THRESHOLDS 

    seatmap_ok
    ✓ 'rate>0.99' rate=100.00%


  █ TOTAL RESULTS 

    checks_total.......: 3000    199.736109/s
    checks_succeeded...: 100.00% 3000 out of 3000
    checks_failed......: 0.00%   0 out of 3000

    ✓ 200

    CUSTOM
    seatmap_ms.....................: avg=6.09ms med=3.08ms p(95)=18.4ms  p(99)=76.05ms max=158.28ms
    seatmap_ok.....................: 100.00% 3000 out of 3000

    HTTP
    http_req_duration..............: avg=6.09ms med=3.08ms p(95)=18.39ms p(99)=76.05ms max=158.28ms
      { expected_response:true }...: avg=6.09ms med=3.08ms p(95)=18.39ms p(99)=76.05ms max=158.28ms
    http_req_failed................: 0.00%   0 out of 3001
    http_reqs......................: 3001    199.802687/s

    EXECUTION
    iteration_duration.............: avg=6.24ms med=3.19ms p(95)=18.7ms  p(99)=76.5ms  max=158.32ms
    iterations.....................: 3000    199.736109/s
    vus............................: 1       min=1            max=6 
    vus_max........................: 50      min=50           max=50

    NETWORK
    data_received..................: 129 MB  8.6 MB/s
    data_sent......................: 249 kB  17 kB/s



running (15.0s), 000/050 VUs, 3000 complete and 0 interrupted iterations
read ✓ [ 100% ] 000/050 VUs  15s  200.00 iters/s